/*
Печать текста
Ограничение времени: 1 с
Ограничение памяти: 64.0 Мб
Ввод: стандартный ввод или input.txt
Вывод: стандартный вывод или output.txt


Напишите программу, печатающую на экране первые строчки со страницы Бьярне Страуструпа про C++:

C++ is a general-purpose programming language with a bias towards systems programming that
  - is a better C
  - supports data abstraction
  - supports object-oriented programming
  - supports generic programming.
Не потеряйте парные пробелы в начале строк и переносы в конце строк.

*/

#include <iostream> 
using namespace std;

int main() {
cout << "C++ is a general-purpose programming language with a bias towards systems programming that\n";
cout << "  - is a better C\n";
cout << "  - supports data abstraction\n";
cout << "  - supports object-oriented programming\n";
cout << "  - supports generic programming.\n";

}